const requirements: string[] = [
  'Художественная литература.',
  'Роман/сборник произведений.',
  'Минимум 50% текста не должно быть ранее (до отправки рукописи в издательство) где-то опубликовано (в том числе в интернете), даже если это самиздат. Книга в платном доступе считается полностью опубликованной, даже если её бесплатный ознакомительный фрагмент составляет менее 50% текста. Произведение, размещённое в платном доступе, но впоследствии удалённое из него, считается опубликованным и не рассматривается издательством',
  'Формат doc/docx.',
];

export { requirements };
