import { Author } from '@/types/author';

export const authors: Author[] = [
  {
    id: 0,
    name: 'О. Новокщёнов',
    dateOfBirth: '24.03.1984',
    city: 'Аскер',
    biography: 'sadfasdfasdfasdfasdf',
    contacts: [],
    photo: undefined,
    phrase: 'asdfasdfasdf',
  },
  {
    id: 1,
    name: 'А. Киреев',
    dateOfBirth: '24.03.1984',
    city: 'Аскер',
    biography: 'sadfasdfasdfasdfasdf',
    contacts: [],
    photo: undefined,
    phrase: 'asdfasdfasdf',
  },
  {
    id: 2,
    name: 'Д. Горшечников',
    dateOfBirth: '24.03.1984',
    city: 'Аскер',
    biography: 'sadfasdfasdfasdfasdf',
    contacts: [],
    photo: undefined,
    phrase: 'asdfasdfasdf',
  },
  {
    id: 3,
    name: 'Катерина Кюне',
    dateOfBirth: '24.03.1984',
    city: 'Аскер',
    biography: `Катерина Кюне, родилась в 1984 году в Магадане. По семейной легенде,
    родители нашли её в громадном сугробе, который намело под их окнами.
    В детстве писала стихи и песни, придумывала страшные истории,
    которыми пугала подруг. Училась в Санкт-Петербургском университете
    телекоммуникаций, но бросила после второго курса. Переехала в
    Москву. Окончила Литературный институт имени Горького. Работала
    методистом, корреспондентом, копирайтером, координатором
    благотворительного фонда, выпускающим редактором, репетитором по
    математике, продавцом-буфетчицей, разработчиком электронных курсов.
    Делала лампы из мусора. Занималась научной журналистикой. На заказ
    написала историческую биографию предков одного из российских
    олигархов. Книга была дорого издана и богата иллюстрирована, но
    кроме семьи олигарха её никто не прочёл. Жила в разных городах: в
    Магадане, Майкопе, Санкт-Петербурге, Москве, Севастополе, Ярославле,
    Бангкоке, Берлине. Сейчас живёт в Аскере — норвежском городке рядом
    с Осло. Зарабатывает трейдингом. Имеет публикации в журналах
    «Знамя», «Эмигрантская лира», «Дружба народов», «Лиterraтура»,
    «Этажи», «Берлин. Берега» (Германия) и других. Лауреат премии
    литературного журнала «Знамя». Автор повести «Здесь должна быть я».`,
    contacts: [],
    photo: '/images/authors/katerina-kune.jpg',
    phrase: `Мне всегда нравилось представлять себя кем-то другим: собакой,
    тюльпаном, соседом дядей Васей, путешественницей к другим планетам.
    В детстве я так играла. Мне хотелось прожить много разных жизней,
    попробовать много разных занятий. Писательство — это реинкарнация
    без необходимости умирать. Можно оказаться там, куда тебе не
    добраться физически, исследовать то, к чему у тебя нет доступа. И
    даже то, чего не существует. Я просто продолжаю играть, вот и всё»`,
  },
  {
    id: 4,
    name: 'Георгий Панкратов',
    dateOfBirth: '24.03.1984',
    city: 'Санкт-Петербурге',
    biography: `Родился в Санкт-Петербурге в 1984 году. Вырос и учился в Севастополе. 
    Автор сборника прозы «Российское время», вошедшего в длинный список премии «Большая книга 2020». 
    Имеет публикации в журналах «Знамя», «Дружба народов», «Новый мир», «Юность».`,
    contacts: [],
    photo: '/images/authors/ponkratov.jpg',
    phrase: `«Мне интересна беззащитность человека, 
    но не только как классического персонажа литературы о маленьких людях, 
    а в целом такая щемящая беззащитность человеческого существа на Земле, 
    как перед неизбежной смертью, так и перед каждодневными задачами жизни».
    `,
  },
];
